In [4]:
import pandas as pd

In [21]:
data = {
    'Name':['Angela','Daniel','Marco','Marco','Angela'],
    'Age':[25, 30, 33,35, 31]
}

In [22]:
df = pd.DataFrame(data)

In [23]:
filter_ = df['Age'] >= 30

In [36]:
df.drop_duplicates()

     Name  Age
0  Angela   25
1  Daniel   30
2   Marco   33
3   Marco   35
4  Angela   31